<a href="https://colab.research.google.com/github/s23912/pad_practicals/blob/main/pad_lab_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
path ='/content/drive/MyDrive/DS/PAD/PAD_02/pad_lab_02_db.csv'

In [ ]:
df = pd.read_csv(path, sep=';')
df

   Name  Age   Country  Salary Gender
0     A   56    Poland    1000      M
1     B   44    Poland    2000      F
2     C   32        UK    4678      F
3     D   44        UK    5444      F
4     E   32        UK    2223      F
5     F   56   Ireland    4567      F
6     J   22   Ireland    7786      F
7     Z   34   Ukraine    6544      M
8     D   37  Iukraine    5444      M
9     D   26  Iukraine    2345      M
10    F   55    Russia    9877      M

In [ ]:
df2 = pd.read_csv(path, sep=';', usecols=['Name','Salary'])
df2

   Name  Salary
0     A    1000
1     B    2000
2     C    4678
3     D    5444
4     E    2223
5     F    4567
6     J    7786
7     Z    6544
8     D    5444
9     D    2345
10    F    9877

In [ ]:
len(df2)

11

In [ ]:
df.count() #liczba wierszy w kazdej kolumnie

Name       11
Age        11
Country    11
Salary     11
Gender     11
dtype: int64

In [ ]:
len(df.keys()) #odczytamy liczbe kolumn

5

In [ ]:
df.columns

Index(['Name', 'Age', 'Country', 'Salary', 'Gender'], dtype='object')

In [ ]:
df.shape

(11, 5)

In [ ]:
women=len(df[df['Gender']=='F'])
print(women)
all=len(df)
print(all)
wp = round((women/all),2)
print(wp)
women_percentage = round(wp*100,2)
print(women_percentage)

6
11
0.55
55.0

In [ ]:
df['Gender'][df['Gender']=='F'].count()

6

In [ ]:
g_q = df['Gender'].value_counts()
g_q

F    6
M    5
Name: Gender, dtype: int64

In [ ]:
g_q[1]

5

In [ ]:
round(df['Gender'].value_counts(normalize=True)['F'],2)

0.55

In [ ]:
round(df['Gender'].value_counts(normalize=True)['M'],2)

0.45

In [ ]:
#ktora wartosc najliczniejsxza wsrod mezczyzn
df

   Name  Age   Country  Salary Gender
0     A   56    Poland    1000      M
1     B   44    Poland    2000      F
2     C   32        UK    4678      F
3     D   44        UK    5444      F
4     E   32        UK    2223      F
5     F   56   Ireland    4567      F
6     J   22   Ireland    7786      F
7     Z   34   Ukraine    6544      M
8     D   37  Iukraine    5444      M
9     D   26  Iukraine    2345      M
10    F   55    Russia    9877      M

In [ ]:
men = df[df['Gender']=='M']
men

   Name  Age   Country  Salary Gender
0     A   56    Poland    1000      M
7     Z   34   Ukraine    6544      M
8     D   37  Iukraine    5444      M
9     D   26  Iukraine    2345      M
10    F   55    Russia    9877      M

In [ ]:
men_countries = df[df['Gender']=='M']['Country'].value_counts()
men_countries

Iukraine    2
Russia      1
Poland      1
Ukraine     1
Name: Country, dtype: int64

In [ ]:
men_countries[men_countries == men_countries.max()]

Iukraine    2
Name: Country, dtype: int64

In [ ]:
list(men_countries[ men_countries == men_countries.max()].index)

['Iukraine']

In [ ]:
# w pierwszych 5 rekordach ile oósb ma wiecje niz x lat
df_f5 = df.iloc[:5,:]
df_f5

  Name  Age Country  Salary Gender
0    A   56  Poland    1000      M
1    B   44  Poland    2000      F
2    C   32      UK    4678      F
3    D   44      UK    5444      F
4    E   32      UK    2223      F

In [ ]:
df_f5[ df_f5['Age']>40]

  Name  Age Country  Salary Gender
0    A   56  Poland    1000      M
1    B   44  Poland    2000      F
3    D   44      UK    5444      F

In [ ]:
len(df_f5[df_f5['Age']>40])

3

In [ ]:
import pandas as pd
#iloc, loc
col_1 =[10,20,30]
col_2 =['A','Z','F']
col_3 =[True, False, True]
ind = ['a','b','c']

data_i =pd.DataFrame({'col1':col_1,'col2':col_2,'col3':col_3},ind)
data_i

   col1 col2   col3
a    10    A   True
b    20    Z  False
c    30    F   True

In [ ]:
print(data_i['col1'][0:2])

a    10
b    20
Name: col1, dtype: int64

In [ ]:
print(data_i['col1']['a'])

10

In [ ]:
print(data_i.iloc[0,1])

A

In [ ]:
print(data_i.loc['a','col2'])

A

In [ ]:
import time

path_a='/content/drive/MyDrive/DS/PAD/PAD_02/Zadanie_4.csv'
start = time.time()
df_a = pd.read_csv(path_a, sep=';')
end = time.time()
df_a.head()
print(df_a.sum())
print('time: ', end-start)

A    9504595
dtype: int64
time:  0.09482455253601074

In [ ]:
import csv
sum_count =0
start= time.time()
with open(path_a, newline='') as dff:
  line_reader = csv.reader(dff, delimiter=';')
  next(line_reader)
  for row in line_reader:
    sum_count += int(row[0])
end= time.time()
print(sum_count)
print('time: ', end-start)

9504595
time:  0.580625057220459

In [ ]:
path7 ='/content/drive/MyDrive/DS/PAD/PAD_02/pad_lab_02_db.csv'

df7 =pd.read_csv(path7, sep=';')
df7

def isOver(x):
  if x > 40:
    return 1
  else:
    return 0

df7['Over40']= df7['Age'].apply(isOver)
df7.head()

  Name  Age Country  Salary Gender  Over40
0    A   56  Poland    1000      M       1
1    B   44  Poland    2000      F       1
2    C   32      UK    4678      F       0
3    D   44      UK    5444      F       1
4    E   32      UK    2223      F       0

In [ ]:
def age_in_months (x,y):
  return x * y

df7['AgeM'] = df7['Age'].apply(age_in_months, args=[12])
df7

   Name  Age   Country  Salary Gender  Over40  AgeM
0     A   56    Poland    1000      M       1   672
1     B   44    Poland    2000      F       1   528
2     C   32        UK    4678      F       0   384
3     D   44        UK    5444      F       1   528
4     E   32        UK    2223      F       0   384
5     F   56   Ireland    4567      F       1   672
6     J   22   Ireland    7786      F       0   264
7     Z   34   Ukraine    6544      M       0   408
8     D   37  Iukraine    5444      M       0   444
9     D   26  Iukraine    2345      M       0   312
10    F   55    Russia    9877      M       1   660

In [ ]:
def get_range(x):
  if x in range(0,19):
    return 0
  elif x in range(19,35):
    return 2
  elif x in range(35,55):
    return 3
  else:
    return 4

In [ ]:
df7['AgeRange'] = df7['Age'].apply(get_range)
df7.head()

  Name  Age Country  Salary Gender  Over40  AgeM  AgeRange
0    A   56  Poland    1000      M       1   672         4
1    B   44  Poland    2000      F       1   528         3
2    C   32      UK    4678      F       0   384         2
3    D   44      UK    5444      F       1   528         3
4    E   32      UK    2223      F       0   384         2